app/controllers/admin/products_controller.rb

  def index
    products_filter_order = ProductsFilterOrder.new(ParamsSanitizer.new(filter_params).sanitize_all)
    @products = products_filter_order.paginate

    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @product = Product.new(product_params)
    @product.build_image(filename: params[:product][:image])

    if @product.save
---
INSERT INTO `images` (`created_at`, `filename`, `product_id`, `updated_at`) VALUES ('2015-09-25 10:25:40', 'index.jpeg', 6, '2015-09-25 10:25:40')
INSERT INTO `products` (`category_id`, `created_at`, `price`, `stock`, `title`, `updated_at`) VALUES (1, '2015-09-25 10:25:40', 21.0, 1, 'Ana', '2015-09-25 10:25:40')

  def destroy
    @product = Product.find_by(id: params[:id])
    @product.image.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 82 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 82