app/views/shared/_cart.html.haml

SELECT COUNT(*) FROM `cart_items` WHERE `cart_items`.`cart_id` = 83
---
    .block-content
      - if @current_cart.nil? || @current_cart.cart_items.count.zero?