app/views/admin/products/new.html.haml

                    %td
                      = f.select :category_id, options_for_select(@categories.each.map {|category| [category.label, category.id] }, selected: params[:category], id: "category_id", class: "select")
---
SELECT `categories`.* FROM `categories`