app/controllers/carts_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 80 LIMIT 1
---
  def add_to
    @product = Product.find_by(id: params[:product_id])

SELECT `cart_items`.* FROM `cart_items` WHERE `cart_items`.`cart_id` = 79 AND `cart_items`.`id` = 7 LIMIT 1
---
  def remove_from
    @cart_item = CartItem.find_by(id: params[:cart_item_id])

UPDATE `cart_items` SET `quantity` = 12, `updated_at` = '2015-09-25 10:34:11' WHERE `cart_items`.`id` = 3
UPDATE `carts` SET `total` = 405.0, `updated_at` = '2015-09-25 10:34:12' WHERE `carts`.`id` = 3
---
  def update_cart_items
    @current_cart.update_quantity_cart_items(params[:cart_item])