app/controllers/categories_controller.rb

  def show
    @category = Category.find_by(id: params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1