app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 80 ORDER BY `products`.`id` ASC LIMIT 1