app/controllers/static_pages_controller.rb

SELECT `products`.* FROM `products` ORDER BY `products`.`id` DESC LIMIT 6
---
  def home
    @products = Product.last(6).reverse