app/views/categories/show.html.haml

SELECT `categories`.* FROM `categories`
---
      .col-left
        =  render 'shared/messages'
        .page-title.category-title