app/controllers/users/sessions_controller.rb

UPDATE `carts` SET `user_id` = 3, `updated_at` = '2015-09-25 09:51:21' WHERE `carts`.`id` = 1
---
  def create
    super

    if current_user # updates the cart for an authenticated user if he/she has a cart as an anonymus user
      @current_cart.update(current_user)